[
  {
    "key": "steam_nano",
    "name": "STEAMNANO | Digital Game",
    "cover": "cover.webp",
    "desc": [
      "STEAMNANO is a 2D side-scrolling action game. Players collect resources (nano spiders) dropped by defeated enemies to craft new weapons or AI support bots that help push forward and defeat foes.",
      "",
      "The video shows player controls, the hero’s attack mode switching, summoning forms, and enemy/player AI pathfinding and attack patterns.",
      "Each enemy has its own behavior: basic grunts strike the player; sword fighters leap and thrust; shield bearers taunt with shield bashes; gunners keep their distance and throw grenades.",
      "When enemies group up, they form automatic formations: sword fighters leap first, grunts follow, shield bearers face the player and raise shields, and gunners widen their range.",
      "",
      "A student project inspired by the Industrial Revolution, combining pixel art with steampunk aesthetics and smooth controls; it was shortlisted for major Taiwanese design awards.",
      "",
      "- 2018 Young Designers’ Exhibition – Interaction Tech & Game Design / Gold Award",
      "- 2018 Vision Get Wild – Special Judge’s Prize (International Vendor) / Art & Creative Design Award",
      "- 2018 Vision Get Wild – Games / Finalist",
      "- 2018 A+ Creative Festival – Digital Media / Finalist",
      "- 2018 Golden Pin Design Award (New Talent) – Annual Best Design / Finalist"
    ],
    "type": "Digital Game Development",
    "date": "2018",
    "works": [
      "Program architecture planning",
      "Scene construction and layer setup",
      "Character animator setup and state machine programming",
      "Character physics and environment interaction system",
      "Character AI follow and targeting system",
      "UGUI feature development",
      "Lighting tuning",
      "Physics and environment interaction system"
    ],
    "tools": ["Unity"],
    "ytIDs": ["x35mN4Qzcn0", "eU9qr4q5leM"],
    "images": []
  },
  {
    "key": "godog",
    "name": "GODOG | Digital Game",
    "cover": "cover.webp",
    "desc": [
      "A 2D vertical scrolling game built in Unity with detailed pixel art and vibrant colors. Players control different dogs climbing upward—at the summit do you become a GOD or remain a DOG?",
      "",
      "The punny title GODOG can mean “GO! DOG” or a blend of GOD and DOG.",
      "",
      "Two difficulty modes: NORMAL and ALIVE. Players keep jumping upward through four stages—Earth’s core, ocean, sky, and space. Reach the top of space and the dog ascends beyond being just a dog.",
      "Five playable dogs spawn randomly; each death respawns you on the same floor as one of them, each with unique abilities:",
      "Shiba Inu: gains +2 more life tadpoles than other dogs; Wolfdog: activates a shield for invincibility.",
      "Dachshund: performs vertical rocket dashes; Pomeranian: slows descent for gliding.",
      "Sheepdog: teleports horizontally.",
      "",
      "A student-era project."
    ],
    "type": "Digital Game Development",
    "date": "2016",
    "works": [
      "Program architecture planning",
      "Scene construction and layer setup",
      "Character animator setup and state machine programming",
      "Character physics and environment interaction system",
      "Character AI follow and targeting system",
      "UGUI feature development",
      "Lighting tuning",
      "Physics and environment interaction system"
    ],
    "tools": ["Unity"],
    "ytIDs": ["2LPwCvOOaHQ"],
    "images": []
  }
]
