[
  {
    "key": "socket-draw",
    "name": "Socket Implementation | Collaborative Drawing Board",
    "cover": "cover.gif",
    "desc": [
      "A collaborative drawing board where users can doodle and interact in real time, upload images, and drag them around the canvas.",
      "Front end written in React.js as a side project evolved from my earlier solo Vue version.\nThe backend uses Socket.io for realtime communication and P5.js for canvas rendering.",
      "After signing in to the Socket server, each user is randomly assigned a color for their brush and image-drag indicator. The color is for identification, so it cannot be changed. The server also returns existing brush strokes and image records so the client can initialize and stay in sync with everyone else before further actions.",
      "To reduce server load from high-frequency socket events, the frontend throttles operations like brush update rates, which also lightens canvas rendering when many people draw together.\nImage uploads are sent in base64 to other users for syncing; clicking selects an image and mouse movement drags it.\nWhen an image is selected, an event notifies others so they cannot manipulate it, preventing conflicts. Image movement shares the current coordinates."
    ],
    "type": "Feature Implementation",
    "date": "2024",
    "works": ["Canvas brush implementation", "Canvas image upload and drag implementation", "Event logic and data transmission", "Socket server design and development", "Front- and back-end architecture planning", "Layout and feature implementation"],
    "tools": ["React.js", "Socket.io", "Canvas", "P5.js", "Tailwind css", "JavaScript", "Material-UI", "Typescript"],
    "ytIDs": ["FkVe5veJT50"]
  },
  {
    "key": "socket-chat",
    "name": "Socket Implementation | Multi-room Realtime Chat",
    "cover": "cover.gif",
    "desc": [
      "Chat implementation that sends and receives messages, plus socket rooms to separate conversations while allowing users to switch rooms freely.",
      "Frontend in React.js as a side project evolved from my earlier solo Vue version.\nBackend uses Socket.io for realtime messaging.",
      "Includes a login verification flow: entering a username requires a password. The password is stored on the Socket server with salting.\nWhen a client attempts to log in, middleware validates the password before allowing access to the server and further actions.",
      "After login, the server returns current configuration and status—room count, active users, and each room's message history—for client-side initialization and syncing. The setup lives on the server and is sent to clients upon login.",
      "Once connected, users choose a room, see its past messages, and the sidebar lists current room members. They can chat and switch rooms via the dropdown.",
      "Users can rename themselves at any time; after submitting, the new name syncs to others. When a user disconnects/leaves, their past messages show “user has left.”",
      "To handle latency-related desync, a sent message stays gray locally until the server returns 200, then turns black to indicate it reached the server and synced to other clients—this mirrors Line’s UX."
    ],
    "type": "Feature Implementation",
    "date": "2024",
    "works": ["Message send and receive", "Socket room functionality", "Login validation and logout", "User rename with sync", "Event logic and data transmission", "Socket server design and development", "Front- and back-end architecture planning", "Layout and feature implementation", "RWD"],
    "tools": ["React.js", "Socket.io", "Canvas", "P5.js", "Tailwind css", "JavaScript", "Material-UI", "Typescript"],
    "ytIDs": ["YvtjQ5_1Teg"]
  },
  {
    "key": "vibe-400",
    "name": "VIBE-400 | Website",
    "cover": "cover.webp",
    "desc": ["Built at a friend’s request to showcase their design work.\nThe layout uses irregular arrangements with many staggered entrance animations, and the site is built with React."],
    "type": "Website",
    "date": "2024",
    "links": [{ "title": "Website", "url": "https://vibe-400.vercel.app/" }],
    "works": ["Motion effects", "Layout and feature implementation", "SVG animation", "RWD"],
    "tools": ["React.js", "Tailwind css", "JavaScript", "GSAP"],
    "ytIDs": ["E1aDCs-cIhg"],
    "images": []
  }
]
