{
  "information": {
    "name": "JIN-CHENG, LIANG ",
    "enName": "( Anton )",
    "title": "Front-end Developer",
    "skill": "Front-end／React.js／Vue.js／JavaScript",
    "place": "Taipei，Taiwan",
    "email": "cs2338139@gmail.com",
    "phone": "0975-601935",
    "linkedin": "https://www.linkedin.com/in/jinchenliang",
    "github": "https://github.com/cs2338139"
  },

  "introduction": [
    "Front-end engineer with extensive experience in interactive design and web development. \nMy programming background began with C# in digital games and human-computer interaction, before transitioning to web development.",
    "Proficient in React.js and Vue.js (Nuxt.js), with a focus on CSR and SSR projects, and a strong ability to implement complex JavaScript dynamic effects. I also have back-end experience in PHP, particularly in developing REST APIs with WordPress CMS.",
    "Skilled in front-end and back-end separation, familiar with Tailwind and Material UI for creating responsive, efficient websites. I have successfully deployed projects to cloud platforms like AWS EC2 using Docker, Nginx, and pm2.",
    "Led large-scale interactive exhibition projects using Socket, managing both architecture and core functionality. Additionally, I have experience in APP and VR/AR development, and have contributed to various interactive installation projects."
  ],
  "skill": [
    {
      "title": "Basic",
      "content": ["React.js", "Vue.js (Nuxt.js)", "TypeScript", "HTML5/CSS/JavaScript", "RWD responsive web design", "Tailwind", "PHP", "C#"]
    },
    {
      "title": "Tool",
      "content": ["Material UI", "Socket.io", "GSAP/ScrollTrigger", "i18n", "Canvas/WebGL", "three.js", "P5.js"]
    },
    {
      "title": "Other",
      "content": ["Git", "AWS EC2/Nginx/Pm2", "Docker"]
    }
  ],
  "experience": [
    {
      "position": "Freelance",
      "for": "Side Project",
      "content": [
        {
          "type": "desc",
          "content": "Currently focused on research and implementation of Socket.io technology.\nOn the front-end, I use React.js as the primary framework, while the back-end Socket.io server is built over HTTPS, with a well-designed user flow and event-driven Socket API for seamless front-end and back-end communication.\nThe entire system is deployed to AWS EC2 using pm2 and Nginx."
        },
        {
          "type": "line"
        },
        {
          "type": "list-p",
          "content": [
            {
              "query": "socket-draw",
              "title": "Socket | Drawing Board",
              "type": "Feature",
              "url": {
                "url": "https://socket-draw.jinchengliang.com/",
                "text": "Demo Link↗"
              }
            },
            {
              "query": "socket-chat",
              "title": "Socket | Multi-room with Chat",
              "type": "Feature",
              "url": {
                "url": "https://socket-chat.jinchengliang.com/",
                "text": "Demo Link↗"
              }
            },
            {
              "query": "point_cloud_changer",
              "title": "Particle-Based Vertex Enhancement Method for 3D Models",
              "type": "Algorithm"
            }
          ]
        }
      ]
    },
    {
      "position": "Front-end Developer",
      "for": "Block Studio",
      "time": "2023/5 - 2024/8",
      "content": [
        {
          "type": "desc",
          "content": "As a front-end engineer, I specialize in developing highly interactive websites and applications, gaining extensive experience throughout my career. I independently led several projects and spearheaded the company’s first Shopify e-commerce and Socket.io server implementation projects.\nMy primary responsibilities included:"
        },
        {
          "type": "list-1",
          "content": [
            "Frontend Development: Developed dynamic and interactive websites using Vue.js and React.js, completing around ten projects across offline exhibitions and e-commerce.",
            "Backend Development: Created PHP REST APIs using WordPress CMS, optimizing existing APIs to enhance data retrieval speed by 60%.",
            "Project Architecture: Designed project structures to streamline development processes, eliminate redundant code, and centralize data integration systems, improving overall project efficiency. Developed reusable components for other engineers.",
            "Dynamic Effects Development: Utilized GSAP, p5.js, and WebGL to create large-scale visual effects, modularizing them for reuse by other engineers.",
            "Documentation: Revamped company documentation standards, increasing development speed by 30% and reducing frontend-backend communication issues.",
            "Mentorship: Guided two new engineers through company projects, providing programming advice and debugging support.",
            "Project Deployment: Deployed projects to AWS EC2 using pm2 and Nginx. Modified existing Docker files to resolve routing issues.",
            "Socket.io Services: Led offline exhibition projects, overseeing the design and API development of the Socket.io architecture.",
            "Technical Research and Sharing: Explored new technologies like Shopify, WebAR, and Socket.io, creating development tools and technical documentation for quick reference by colleagues."
          ]
        }
      ]
    },
    {
      "position": "Front-end Developer/Interactive Developer",
      "for": "Axis 3D Technology, Inc. / Pixelight",
      "time": "2020/10 - 2023/2",
      "content": [
        {
          "type": "desc",
          "content": "Worked in the company's project department, with development projects mainly focused on web and interactive design, and became the person in charge of company website-related projects.\nDeveloped several website front-ends and participated in interactive design:"
        },
        {
          "type": "list-1",
          "content": [
            "APP application, website development",
            "Determining the technology required for projects",
            "Experience process design and program logic writing, architecture planning",
            "Project technology integration",
            "Project online deployment, Google Play and APP Store publishing",
            "New technology research and development and application testing",
            "On-site project installation and adjustment",
            "Hardware project research and development testing"
          ]
        }
      ]
    },
    {
      "position": "Interactive Developer",
      "for": "Play Design Lab",
      "content": [
        {
          "type": "desc",
          "content": "Used Unity as the main development tool, while also using different development tools such as Arduino and Raspberry Pi as needed.\nParticipated in multiple interactive developments:"
        },
        {
          "type": "line"
        },
        {
          "type": "list-p",
          "content": [
            {
              "title": "2020 National Science and Technology Museum - Towards AIoT Imagery Wall"
            },
            {
              "query": "ai_shoes_maker",
              "title": "2020 National Science and Technology Museum - AI Shoemaker Interactive Installation"
            },
            {
              "title": "2020 Shengping Theater - 'Seat Without Vacancy: Shengping Theater ╳ Taiwan Old Theater Special Exhibition'"
            },
            {
              "query": "play_flower",
              "title": "2020 Play Flower Digital VR Experience"
            },
            {
              "title": "2020 Ordinary Tea VR Experience"
            }
          ]
        }
      ]
    }
  ],
  "education": [
    {
      "position": "Bachelor",
      "for": "Southern Taiwan University of Science and Technology, Department of Multimedia and Computer Entertainment Science / Game Engineering Program",
      "time": "2014/9 - 2018/6",
      "content": [
        {
          "type": "desc",
          "content": "During my time in the department, I majored in game development, using Unity with C# to develop multiple small game projects. While accumulating programming development experience, I also gained many teamwork skills.\nThe graduation project was shortlisted for several domestic multimedia game awards:"
        },
        {
          "type": "list-2",
          "content": ["Vision Get Wild", "Golden Pin Design Award", "A+ Creative Festival", "Youth Design Festival", "'Gold Award' in Interactive Technology and Game Design Category"]
        }
      ]
    }
  ]
}
